[
    {
        "name": "24hr breakfast",
        "message": "Showed up after ordering online. They gave my order to someone else the lady I talked to just said well I'm off and proceeded to walk away. A lot Jen staff member eventually came over and said they gave my order to someone else 40 minutes ago (I showed them I ordered it exactly 25 minutes ago and was waiting there for about 5 minutes they just said sorry we gave it away. I asked if they were going to remake it they said no you have to go online and report it they can't refund me or make the food and walked away. Pretty awful service from both people not taking ownership I wasn't upset or disrespectful I just either wanted the food or me find they refused to do either. Will never go back there is a reason this place is empty apparently.",
        "analysis": {
            "food": [
                {
                    "label": "Neutral"
                }
            ],
            "service": [
                {
                    "label": "Negative"
                }
            ],
            "atmosphere": [
                {
                    "label": "Neutral"
                }
            ],
            "cost": [
                {
                    "label": "Neutral"
                }
            ]
        }
    },
    {
        "name": "24hr breakfast",
        "message": "Ordered to-go here one morning after a long night at work. Upon arrival, I was greeted by a very friendly worker who was obviously enjoying her day as she was smiling and humming a song. My food was ready and hot. They got my order perfectly and it was so tasty. My husband got the grand slammwich and the bread was perfectly toasted, not too hard not too soft. The eggs and meat inside were also great. We had a side of hash browns which were also nice. The pancakes were huge and hot off the skillet. Very pleasing. They even remembered all of our condiments (weird to be excited about this but let me tell you, when almost every other restaurant forgets your condiments, it's awesome when someone actually remembers) syrup, ketchup, and even jellies. So happy. We were very content this morning when we got a nice warm breakfast that we didn't even have to cook ourselves. Will definitely be back again. Thanks morning shift person.",
        "analysis": {
            "food": [
                {
                    "label": "Positive"
                }
            ],
            "service": [
                {
                    "label": "Positive"
                }
            ],
            "atmosphere": [
                {
                    "label": "Neutral"
                }
            ],
            "cost": [
                {
                    "label": "Neutral"
                }
            ]
        }
    },
    {
        "name": "24hr breakfast",
        "message": "Good service, good food, food came hot and quick to the table, social distancing was enforced and the actual restaurant was clean. Definitely recommend for diner food.",
        "analysis": {
            "food": [
                {
                    "label": "Positive"
                }
            ],
            "service": [
                {
                    "label": "Positive"
                }
            ],
            "atmosphere": [
                {
                    "label": "Positive"
                }
            ],
            "cost": [
                {
                    "label": "Positive"
                }
            ]
        }
    },
    {
        "name": "24hr breakfast",
        "message": "Like a truck stop but the waitress is still happy, this Denny's was picked by a friend late at night. We were starved. Ordered a big breakfast which came out fast. The cook did a fab job. Fluffy pancakes. Eggs cooked just right. The A/C was blasting at 1 am and the waitress offered her coat to my shivering friend. She declined but what a sweetheart. We heard a guy in the kitchen singing with the radio while waiting for our food. Put all the love in it! Place is a bit disheveled with crayon on the wall, old booths and such but for a fast, cheap breakfast from angels this was wonderful.",
        "analysis": {
            "food": [
                {
                    "label": "Positive"
                }
            ],
            "service": [
                {
                    "label": "Positive"
                }
            ],
            "atmosphere": [
                {
                    "label": "Negative"
                }
            ],
            "cost": [
                {
                    "label": "Neutral"
                }
            ]
        }
    },
    {
        "name": "24hr breakfast",
        "message": "Went to this Denny's with my boyfriend on the way home from a Mariners game. We ordered the Super Bird and a side caesar to split. While we waited for the food to arrive, I read some of the Quick Tips for this place on the Android App. Several people raved about a waitress named Dawn and our waitress happened to be her as well! She was definitely great, super nice, and very attentive. Food was fine, nothing fancy - it's Denny's! But it hit the spot and we were happy. My boyfriend kindly told me about a shooting that happened here a few years ago...that wasn't a very fun part of the meal. The parking lot is pretty shady and they built a large wall to separate the restaurant from the nearby bar, which is apparently where the shooter came from. Lovely! I'd like to come back here for breakfast sometime soon - there's nothing like a big, greasy plate of Denny's breakfast food. Seriously. Yum!",
        "analysis": {
            "food": [
                {
                    "label": "Positive"
                }
            ],
            "service": [
                {
                    "label": "Positive"
                }
            ],
            "atmosphere": [
                {
                    "label": "Negative"
                }
            ],
            "cost": [
                {
                    "label": "Positive"
                }
            ]
        }
    },
    {
        "name": "24hr breakfast",
        "message": "Their food is good and staff is friendly but their service is very slow. If you are in hurry I suggest you avoid this place",
        "analysis": {
            "food": [
                {
                    "label": "Positive"
                }
            ],
            "service": [
                {
                    "label": "Negative"
                }
            ],
            "atmosphere": [
                {
                    "label": "Neutral"
                }
            ],
            "cost": [
                {
                    "label": "Neutral"
                }
            ]
        }
    },
    {
        "name": "24hr breakfast",
        "message": "Dennys is usually great..I'm not sure if the franchise is suffering but it sure seems that way based on my past 3 experiences in 3 different locations. Dirty carpets and bathrooms, slow service, cold food and bad presentation. My only complement is the waitresses have been friendly.",
        "analysis": {
            "food": [
                {
                    "label": "Negative"
                }
            ],
            "service": [
                {
                    "label": "Positive"
                }
            ],
            "atmosphere": [
                {
                    "label": "Negative"
                }
            ],
            "cost": [
                {
                    "label": "Negative"
                }
            ]
        }
    },
    {
        "name": "24hr breakfast",
        "message": "Waitresses have bad attitudes. Don't listen to orders from customers. Often forget to bring what the tables asked from them, giving the customers a bad attitude when they call them out on it. Food was good but service was horrendous. I hope if you ever come to this place I hope you don't get the waiter with the thin eyebrows blond hair and hoop silver earrings because the only word I can think of when I think of her is Donald Trump. Absolutely starstruck.",
        "analysis": {
            "food": [
                {
                    "label": "Positive"
                }
            ],
            "service": [
                {
                    "label": "Negative"
                }
            ],
            "atmosphere": [
                {
                    "label": "Neutral"
                }
            ],
            "cost": [
                {
                    "label": "Neutral"
                }
            ]
        }
    },
    {
        "name": "24hr breakfast",
        "message": "Good food I love Denny's . That's about it though , our waiter was nice but they had bad service she never came to check if we needed anything she just came brought us our food and didn't even come back we didn't even get our check .",
        "analysis": {
            "food": [
                {
                    "label": "Positive"
                }
            ],
            "service": [
                {
                    "label": "Negative"
                }
            ],
            "atmosphere": [
                {
                    "label": "Neutral"
                }
            ],
            "cost": [
                {
                    "label": "Neutral"
                }
            ]
        }
    },
    {
        "name": "24hr breakfast",
        "message": "best hashbrowns ive ever had, perfectly cooked eggs, very nice waitress, there was a rat in the dumpster though which gives it -1 star, the view was nice though.",
        "analysis": {
            "food": [
                {
                    "label": "Positive"
                }
            ],
            "service": [
                {
                    "label": "Positive"
                }
            ],
            "atmosphere": [
                {
                    "label": "Positive"
                }
            ],
            "cost": [
                {
                    "label": "Neutral"
                }
            ]
        }
    },
    {
        "name": "24hr breakfast",
        "message": "Today's meal at this Denny's was just average. My sirloin steak was cooked right to my liking, but the meat was rather chewy and had quite a bit of gristle. My boyfriend's meal was also just average; eggs and bacon were decent but nothing special. The service was okay, the waiter was friendly but slow. The restaurant is quite outdated and could use a little work, but nothing that should really detract from the meal itself. Overall, this isn't my favorite Denny's but it's an okay option if you're in the area.",
        "analysis": {
            "food": [
                {
                    "label": "Neutral"
                }
            ],
            "service": [
                {
                    "label": "Neutral"
                }
            ],
            "atmosphere": [
                {
                    "label": "Neutral"
                }
            ],
            "cost": [
                {
                    "label": "Neutral"
                }
            ]
        }
    },
    {
        "name": "24hr breakfast",
        "message": "Went to this diner expecting a decent meal. The food was pretty average, nothing that stood out or made it memorable. The service, however, was good. The staff were friendly and attentive, which made the experience pleasant. Unfortunately, the price was a bit on the expensive side for what you get. And the view? A brick wall. Not exactly scenic. Overall, it was a fine experience, but I don’t think I’ll be rushing back any time soon given the cost and lack of a view.",
        "analysis": {
            "food": [
                {
                    "label": "Neutral"
                }
            ],
            "service": [
                {
                    "label": "Positive"
                }
            ],
            "atmosphere": [
                {
                    "label": "Negative"
                }
            ],
            "cost": [
                {
                    "label": "Negative"
                }
            ]
        }
    }
]
